<template>
  <!-- 定义了 SVG 的坐标系统，表示图形的坐标范围从 (0, 0) 到 (1024, 1024)。 -->
  <svg
    viewBox="0 0 1024 1024"
    xmlns="http://www.w3.org/2000/svg"
  >
  <!-- M64 896V128h896v768H64z：
      M64 896：移动到坐标 (64, 896)。
      V128：垂直线到 y 坐标 128。
      h896：水平线向右 896 个单位。
      v768：垂直线向下 768 个单位。
      H64：水平线到 x 坐标 64。
      z：关闭路径，形成一个封闭的矩形。 -->
    <path
      d="M64 896V128h896v768H64z m64-128l192-192 116.352 116.352L640 448l256 307.2V192H128v576z m224-480a96 96 0 1 1-0.064 192.064A96 96 0 0 1 352 288z"
    />
  </svg>
</template>

<script>
export default {
  name: 'ImgPlaceholder'
};
</script>
